# greyvbss
# cilik-userbot

from time import sleep
from userbot import CMD_HANDLER as cmd
from userbot import CMD_HELP
from userbot.utils import edit_or_reply, cilik_cmd


@cilik_cmd(pattern="heu(?: |$)(.*)")
async def _(event):
    await edit_or_reply(
        event,
        "▒▒▒▒▒▄██████████▄▒▒▒▒▒\n"
        "▒▒▒▄██████████████▄▒▒▒\n"
        "▒▒████████████████▄▒▒▒\n"               
        "▒▐███▀▀▀▀▀██▀▀▀▀▀███▌▒\n"
        "▒███▒▒▌■▐▒▒▒▒▌■▐▒▒███▒\n"
        "▒▐██▄▒▀▀▀▒▒▒▒▀▀▀▒▄██▌▒\n"
        "▒▒▀████▒▄▄▒▒▄▄▒████▀▒▒\n"
        "▒▒▐███▒▒▒▀▒▒▀▒▒▒███▌▒▒\n"
        "▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒\n"
        "▒▒▒██▒▒▀▀▀▀▀▀▀▀▒▒██▒▒▒\n"
        "▒▒▒▐██▄▒▒▒▒▒▒▒▒▄██▌▒▒▒\n"
        "▒▒▒▒▀████████████▀▒▒▒▒\n")
    
    
@cilik_cmd(pattern="hem(?: |$)(.*)")
async def _(event):
    await edit_or_reply(
        event,
        " ╭━┳━╭━╭━╮╮\n"
        " ┃┈┈┈┣▅╋▅┫┃\n"
        " ┃┈┃┈╰━╰━━━━━━╮\n"
        " ╰┳╯┈┈┈┈┈┈┈┈┈◢▉◣\n"
        "   ╲┃┈┈┈┈┈┈┈┈┈┈▉▉▉\n"
        "   ╲┃┈┈┈┈┈┈┈┈┈┈◥▉◤\n"
        "   ╲┃┈┈┈┈╭━┳━━━━╯\n"
        "   ╲┣━━━━━━┫\n"
        "      **MENCURIGAKAN**\n")
    

@cilik_cmd(pattern="wle(?: |$)(.*)")
async def _(event):
    await edit_or_reply(
        event,
        "┈╭━━━━━━━━━━━╮┈\n" 
        "╭╯┈╭━━╮┈╭━━╮┈╰╮\n" 
        "┃┈┃┃╭╮┃┈┃╭╮┃┃┈┃\n" 
        "┃┈┃┻┻┻┛┈┗┻┻┻┃┈┃\n" 
        " ┃┈┃╭╮┈◢▇◣┈╭╮┃┈┃\n" 
        "╰┳╯┃╰━━┳┳┳╯┃╰┳╯\n" 
        "┈┃┈╰━━━┫┃┣━╯┈┃┈\n" 
        "┈┃┈┈┈┈┈╰━╯┈┈┈┃┈\n")
    
    
@cilik_cmd(pattern="peler(?: |$)(.*)")
async def _(event):
    zz = await edit_or_reply(event, "MAU LIAT PELER GA???")
    sleep(1)
    await zz.edit("NIHHHH DIAA")
    sleep(1)  
    await zz.edit("░░░░█─────────────█──▀──\n"
                  "░░░░▓█───────▄▄▀▀█──────\n"
                  "░░░░▒░█────▄█▒░░▄░█─────\n"
                  "░░░░░░░▀▄─▄▀▒▀▀▀▄▄▀──SIJONI─\n"
                  "░░░░░░░░░█▒░░░░▄▀────PANJANG\n"
                  "▒▒▒░░░░▄▀▒░░░░▄▀───DAN─\n"
                  "▓▓▓▓▒░█▒░░░░░█▄───PEMBERANI─\n"
                  "█████▀▒░░░░░█░▀▄───CROTT──\n"
                  "█████▒▒░░░▒█░░░▀▄─AHHH──\n"
                  "███▓▓▒▒▒▀▀▀█▄░░░░█──────\n"
                  "▓██▓▒▒▒▒▒▒▒▒▒█░░░░█─────\n"
                  "▓▓█▓▒▒▒▒▒▒▓▒▒█░░░░░█────\n"
                  "░▒▒▀▀▄▄▄▄█▄▄▀░░░░░░░█─\n")
    
    
@cilik_cmd(pattern="ahh(?: |$)(.*)")
async def _(event):
    zz = await edit_or_reply(event, "ahhh")
    await zz.edit("ahhh ahhh")
    await zz.edit("ahhh ahhh ahhh")
    await zz.edit("🥵")
    sleep(1)
    await zz.edit("⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⡠⠢⠏⣉⣉⠣⢦⡀⠄⠄⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣐⢪⠅⣱⣟⢛⢧⠄⣷⠄⠄⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⠄⠠⣬⣀⣢⣕⡽⢯⣩⣳⣷⠧⡆⠄⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⠄⢠⡭⡾⣆⢿⡙⢟⢻⣿⡿⡹⣶⠅⠄⠄⠄ \n"
                  "⠄⠄⠄⠄⠄⠄⠄⣔⠄⡗⢫⠘⠷⠾⠿⠟⠙⣡⢢⢖⠄⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⠄⢫⠺⠁⡹⢸⣿⣿⣿⡟⠲⣦⣌⢄⡇⠄⠄\n"
                  "⠄⠄⠄⠄⠄⠄⢀⡈⢛⠨⠥⡄⣿⣿⣿⣧⢯⡻⡇⠨⣁⠄⠄\n"
                  "⠄⠄⠄⠄⠄⢠⡤⢠⣶⣿⣿⣿⣿⣿⣿⣿⣷⢗⠵⡐⡣⡄⠄\n"
                  "⠄⠄⠄⠄⠄⠸⢡⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣷⡄⢶⡇⡇⠄\n"
                  "⠄⠄⠄⠄⠄⣠⣿⣿⣿⣿⣿⠟⢸⣿⣿⣿⡟⡻⣿⠘⠧⡇⠄\n"
                  "⠄⠄⠄⠄⠄⢳⣿⣿⣿⡿⣫⣾⣜⢿⣿⣿⣷⣶⡿⢀⠗⡇⠄\n"
                  "⠄⠄⠄⠄⠄⣦⡝⣭⣵⣾⣿⣿⣿⣦⣍⣛⣛⣫⠡⣼⢾⣿⠄\n"
                  "⠄⠄⠄⠄⢰⣿⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄⠨⣿⡟⠄\n"
                  "⠄⠄⠄⢀⣿⡿⣿⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢆⣶⣿⠇⠄\n"
                  "⠄⠄⠄⢸⣿⣷⠎⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⢯⣿⣷⣻⡆⠄\n"
                  "⠄⠄⢀⣿⣿⠏⢸⡟⢿⣿⣿⣸⣿⣿⣿⣿⢏⣾⣿⣿⣏⣷⠄\n"
                  "⠄⠄⣸⣿⠏⢀⣼⣿⣎⡻⢿⣿⣿⣿⠿⣣⣾⣿⣿⣿⣿⣽⠄\n"
                  "⠄⠄⣿⡿⣰⣿⣿⣿⣿⣿ AHHH ⣰⣿⣿⣿⣿⣿⣿⣿\n")
    
   
CMD_HELP.update(
    {
        "animasi3": f"➢ **Plugin : **`animasi3`\
        \n\n ┌✪ **Syntax :** `{cmd}heu`\
        \n └✪ **Function : **Mengirim Gambar Monyet.\
        \n\n ┌✪ **Syntax :** `{cmd}hem`\
        \n └✪ **Function : **Mengirim Gambar Anjing Mencurigakan.\
        \n\n ┌✪ **Syntax :** `{cmd}wle`\
        \n └✪ **Function : **Mengirim Gambar Anjing Melet.\
        \n\n ┌✪ **Syntax :** `{cmd}peler`\
        \n └✪ **Function : **Mengirim Gambar Peler.\
        \n\n ┌✪ **Syntax :** `{cmd}ahh`\
        \n └✪ **Function : **Mengirim Gambar Uhh Ahh Uhh Ahh.\
    "
    }
)

